Repository: gitGNU/gnu_freedink
Catalog: po/*.po
Languages: th

source: Usage: %s [OPTIONS]...
th: การใช้งาน %s [OPTIONS]...

source: Starts the Dink Smallwood game or one of its D-Mods.
th: เริ่มเกม Drink Smallwood หรือหนึ่งใน D-Mods

source: Edit the Dink Smallwood game or one of its D-Mods.
th: แก้ไขเกม Dink Smallwood หรือหนึ่งใน D-Mods

source: -h, --help Display this help screen
th: -h, --help แสดงหน้าวิธีใช้นี้

source: -v, --version Display the version
th: -v, --version แสดงเวอร์ชัน

source: -g, --game <dir> Specify a DMod directory
th: -g, --game <dir> ระบุไดเรกทอรี DMod

source: -r, --refdir <dir> Specify base directory for dink/graphics, D-Mods, etc.
th: -r, --refdir <dir> ระบุไดเรกทอรีฐานสำหรับเครื่องดื่ม/กราฟิก, D-Mods, ฯลฯ

source: -d, --debug Explain what is being done
th: -d, --debug อธิบายว่าได้ทำอะไรไปบ้าง

source: -i, --noini Do not attempt to write dinksmallwood.ini
th: -i, --noini อย่าพยายามเขียน dinksmallwood.ini

source: -j, --nojoy Do not attempt to use joystick
th: -j, --nojoy อย่าพยายามใช้จอยสติ๊ก

source: -s, --nosound Do not play sound
th: -s, --nosound ปิดเสียง

source: -t, --truecolor Allow more colours (for recent D-Mod graphics)
th: -t, --truecolor ใช้สีมากขึ้น (สำหรับกราฟิก D-Mod เมื่อเร็วๆ นี้)

source: -w, --window Use windowed mode instead of screen mode
th: -w, --window ใช้โหมดหน้าต่างแทนโหมดจอภาพ

source: -7, --v1.07 Enable v1.07 compatibility mode
th: -7, --v1.07 เปิดใช้โหมดความเข้ากันได้ v1.07

source: Report bugs to %s.
th: รายงานปัญหาที่ %s.

source: Note: -nomovie is accepted for compatiblity, but has no effect.
th: Note: ยอมรับความเข้ากันได้ -nomovie แต่ไม่มีผล

source: `$I don't see anything here.
th: `$ฉันไม่พบอะไรที่นี่

source: `$Huh?
th: `$หือ?

source: `$I'm fairly sure I can't talk to or use that.
th: `$ฉันค่อนข้างแน่ใจว่าฉันพูดหรือใช้สิ่งนั้นไม่ได้

source: `$What?
th: `$อะไรนะ?

source: `$I'm bored.
th: `$ฉันรู้สึกเบื่อ

source: `$Not much happening here.
th: `$ไม่มีค่อยมีอะไรเกิดขึ้นที่นี่

source: `$I don't know any magic.
th: `$ฉันไม่รู้จักเวทมนตร์อะไร

source: `$I'm no wizard!
th: `$ฉันไม่ใช่พ่อมด!

source: `$I need to learn magic before trying this.
th: `$ฉันต้องเรียนรู้เวทมนตร์ก่อนลองสิ่งนี้

source: `$I'm gesturing wildly to no avail!
th: `$ฉันออกท่าออกทางอย่างไร้จุดหมายโดยไม่เกิดผล!

source: `$Nothing happened.
th: `$ไม่มีอะไรเกิดขึ้น

source: `$Hocus pocus!
th: `$โอม เพี้ยง!

source: Attack
th: โจมตี

source: Talk/Examine
th: สนทนา/สำรวจ

source: Magic
th: เวทมนตร์

source: Item Screen
th: หน้าจอรายการ

source: Main Menu
th: เมนูหลัก

source: Map
th: แผนที่

source: Unused
th: ไม่ได้ใช้งาน

source: Down
th: ลง

source: Left
th: ซ้าย

source: Right
th: ขวา

source: Up
th: บน

source: Error: not mapped
th: ผิดพลาด: ไม่ได้ทำแผนที่ไว้

source: Slot %d - %d:%02d - %s
th: สล็อต %d - %d:%02d - %s

source: Slot %d - Empty
th: สล็อต %d - ว่างเปล่า
